In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt 
%matplotlib inline
import matplotlib
matplotlib.rcParams["figure.figsize"] == (20,10)

False

In [3]:
df=pd.read_csv('DoanhThuDemo.csv')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99129 entries, 0 to 99128
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0                99129 non-null  object
 1   Ma Cua Hang  99129 non-null  object
 2   Doanh Thu    99126 non-null  object
 3   Chi Phi      99125 non-null  object
 4   Loi Nhuan    99128 non-null  object
dtypes: object(5)
memory usage: 3.8+ MB

In [27]:
df.head(10)

            Ma Cua Hang    Doanh Thu    Chi Phi  Loi Nhuan
0  1/1/2021     CH 0001  14651-14600      12685       1966
1  1/1/2021     CH 0002          NaN        NaN  1243-1200
2  1/1/2021     CH 0003          NaN       7017       1709
3  1/1/2021     CH 0004        27120      23788       3332
4  1/1/2021     CH 0005         9195  7452-7000       1743
5  1/1/2021     CH 0006        19903      18601       1302
6  1/1/2021     CH 0007        63208      55556       7652
7  1/1/2021     CH 0008        27605      25083       2522
8  1/1/2021     CH 0009  15918-15900      13716       2202
9  1/1/2021     CH 0010        13108        NaN       1925

In [7]:
df.columns

Index([' ', 'Ma Cua Hang', 'Doanh Thu', 'Chi Phi', 'Loi Nhuan'], dtype='object')

In [11]:
df['Doanh Thu'].describe()

count     99126
unique    40235
top           0
freq         73
Name: Doanh Thu, dtype: object

In [12]:
df.dtypes

               object
Ma Cua Hang    object
Doanh Thu      object
Chi Phi        object
Loi Nhuan      object
dtype: object

In [37]:
df['Doanh Thu'].value_counts()

0              73
23748          15
22062          12
20458          12
22333          12
               ..
5696            1
15420           1
18815           1
4243            1
14651-14600     1
Name: Doanh Thu, Length: 40235, dtype: int64

In [14]:
df.isnull().sum()

               0
Ma Cua Hang    0
Doanh Thu      3
Chi Phi        4
Loi Nhuan      1
dtype: int64

In [45]:
def is_float(x):
    try:
            float(x)
    except:
            return False
    return  True

In [46]:
df[~df['Doanh Thu'].apply(is_float)].head()

             Ma Cua Hang    Doanh Thu Chi Phi Loi Nhuan
0   1/1/2021     CH 0001  14651-14600   12685      1966
8   1/1/2021     CH 0009  15918-15900   13716      2202
15  1/1/2021     CH 0016  32638-32000   26933      5705

In [47]:
df[~df['Chi Phi'].apply(is_float)].head(5)

                 Ma Cua Hang Doanh Thu    Chi Phi Loi Nhuan
4       1/1/2021     CH 0005      9195  7452-7000      1743
73955  1/13/2021     CH 3994      1882  1604-1604       278

In [48]:
df[~df['Loi Nhuan'].apply(is_float)].head()

                 Ma Cua Hang Doanh Thu Chi Phi  Loi Nhuan
1       1/1/2021     CH 0002       NaN     NaN  1243-1200
74059  1/13/2021     CH 4098      8088    7391    697-600

In [57]:
def covert_to_num(x):
    tokens= str(x).split('-')
    if len(tokens)== 2:
        return (float(tokens[0])+float(tokens[1]))/2
    try: 
        return float(x)
    except :
        return None

In [62]:
# df=df[df['Doanh Thu'].notnull()]
df['Doanh Thu']=df['Doanh Thu'].apply(covert_to_num)
df.head()

            Ma Cua Hang  Doanh Thu    Chi Phi Loi Nhuan
0  1/1/2021     CH 0001    14625.5      12685      1966
3  1/1/2021     CH 0004    27120.0      23788      3332
4  1/1/2021     CH 0005     9195.0  7452-7000      1743
5  1/1/2021     CH 0006    19903.0      18601      1302
6  1/1/2021     CH 0007    63208.0      55556      7652